trade_exp/src/Catalogs/ОбъектыДоставки/ОбъектыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8a524563-74ec-492a-ad57-be7d69cd00c2">
  <name>ОбъектыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <owners>Catalog.Склады</owners>
  <owners>Catalog.СтруктураПредприятия</owners>
  <attributes extendedConfigurationObject="b632079c-a491-4c8e-a728-90dacee78346">
    <name>ВозможностьПодъезда</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2668b2c7-b6ec-40d4-b565-489e4e610198">
    <name>ВремяРаботыБудниПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="88d72d78-5ca5-4de7-850c-770d258db261">
    <name>Долгота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="28bba8b3-7f4d-41ff-9455-7e94462d858a">
    <name>ВремяРаботыБудниС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="da76be5e-62bc-49f1-a480-3baa840d8945">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56dae0a6-ed25-4a8f-8960-60080f0a83d8">
    <name>Широта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67a11e9d-fb21-4fbe-b1e9-25b19a4610c6">
    <name>ВремяОбедаС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ee7fac32-7ba7-4358-9411-5e0d6ee7dda0">
    <name>ВремяОбедаПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b86ed39b-61ff-4079-8183-bd1677526f23">
    <name>ВремяРаботыСубботаС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6f4ad0c2-296a-4c89-adc8-16799ecba27a">
    <name>ВремяРаботыСубботаПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea2edc56-a45e-4c53-9a85-6f3eff97fd59">
    <name>ВремяРаботыВоскресеньеС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0cc15041-40ec-4318-9cfe-5710655d1cbd">
    <name>ВремяРаботыВоскресеньеПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bbecceea-1384-494e-9c85-a679c5fce7b1">
    <name>Выходные</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>67</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f9744db6-485c-438f-8d91-cf893d00a27f">
    <name>ТелефонНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="60ca7753-bbb8-431d-a875-aea1947fc08e">
    <name>ТипТорговойТочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="59d76235-dd31-458d-9411-3d9b7a493afc">
    <name>ФорматТорговогоЗала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a986424d-0a3e-4740-aca8-895cd32b4426">
    <name>СпособПолученияТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4d73832a-12f5-4f0d-a4aa-c15f4f66a53c">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="85dd6c90-1e42-443a-b972-69f9e2f364d2">
    <name>ПлощадьТорговогоЗала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a0fba8eb-3c71-45fc-bd14-5b04ba97ac80">
    <name>ПлощадьСклада</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3a8443db-459d-4bf3-a25d-2cbc05e35069">
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18e4024d-4ba5-4991-a924-640fa009ae81">
    <name>ТипПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d32c2e6-e32c-48e0-b914-04ada48b2f00">
    <name>ЗонаДоставкиДляВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c339f18-9086-4fbc-985e-6417c85b5e4b">
    <name>Стенд</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d8cda761-0307-4453-a140-4b158f1006f4">
    <name>Субдилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="947bed4f-bc19-4990-baef-be8e1867234b">
    <name>Маркетплейс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="80c5f1a6-5211-42f4-a726-b34e70d01865">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b75d8f95-105a-4f58-aa1b-259a534bca75">
    <name>СозданАвтоматически</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="c2408c15-215d-4387-95bd-b0084a6336b2">
    <name>Стенды</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2a2c4a5a-ed90-4dbd-8431-204a72194ec1">
      <name>Стенд</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="d86afa7e-20a5-4cb3-b378-2f0a999ca4dd">
    <name>Субдилеры</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f37527f6-53de-448e-8079-ce81f042232e">
      <name>Субдилер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Enums/ВидыДоставокДоКлиента/ВидыДоставокДоКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыДоставокДоКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b4cc6bd2-b207-434d-b027-c3ef416c447c">
    <name>Розничная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8cebbe69-bf66-4554-90d5-9fe9e46e6dbf">
    <name>СборнаяОРК</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4da8f5b7-705c-495c-976b-5d4823a1f879">
    <name>Внутренняя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e3544ba3-ce9f-46e6-9877-fa2b4b9656af">
    <name>ДистрибуцияСборныеГрузы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ТарифыПеревозчиков/ТарифыПеревозчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="24c6a877-4f1c-4dbe-afb2-d94aadcead01">
  <name>ТарифыПеревозчиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="af0ac3df-db57-4183-8f2f-690eb51fb7d7">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9485158f-d008-4268-945c-d6ccca95a414">
    <name>ДляСборнойОРК</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="93b2577d-07a8-4182-a89b-a956fb1b33da">
    <name>ГрузоподъемностьВТоннах</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b60e2725-f2a3-4f1e-ba28-2760fa52f893">
    <name>ТарифПрофлистТруба</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="af3e0131-96c4-4efe-b0f1-3198439f97d1">
    <name>Экспресс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ed070249-95fe-4a98-aab0-687b9c77e115">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0b074e78-b04d-4a01-8bd7-ae8bc98e9218">
    <name>ВидДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a66cdaaa-9ce3-4dff-94b1-7b398fd9911f">
    <name>СтоимостьЗаЧас</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7c245426-7e60-40e8-ba5d-8d7bcef069b7">
    <name>ТипДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="173d0c50-31b7-4740-bfa8-fcf2ecd4cb3e">
    <name>ВидАвтомобиля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1fb4fa03-6903-4f59-b1bd-43ee3147ba73">
    <name>ПоТарифуВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="534bf2b0-41b4-4620-8bea-39b957ce0fe4">
    <name>ТипТС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="82542f57-0260-41d9-a912-baa0edf17a05">
    <name>ЗонаДействияТарифа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5474e448-a36e-4ba0-a641-426f0e6e5d47">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c1c8ae76-4d22-4453-99ac-41a37bb16432">
    <name>МаксимальнаяДлинаГруза</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="f6b842ad-f897-4c64-9e40-32c5b9803fd6">
    <name>Интервалы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6754cc9c-9c93-41ca-aa85-a8a9fa1e9531">
      <name>Интервал</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/ОбъектыДоставки/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СПТипов = АльтерраОбщегоНазначения.ПолучитьСписокЗначениеДопРеквизита("Тип покупателя");
	АльтерраОбщегоНазначения.ЗаполнитьСписокВыбора(СПТипов, Элементы.ТипПокупателя.СписокВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не Элементы.ГруппаСуббота.Видимость Тогда
		
		Если ЗначениеЗаполнено(Объект.ВремяРаботыСубботаС) Тогда
			Объект.ВремяРаботыСубботаС = Дата(1,1,1,0,0,0);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ВремяРаботыСубботаПО) Тогда
			Объект.ВремяРаботыСубботаПО = Дата(1,1,1,0,0,0);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Элементы.ГруппаВоскресенье.Видимость Тогда
		
		Если ЗначениеЗаполнено(Объект.ВремяРаботыВоскресеньеС) Тогда
			Объект.ВремяРаботыВоскресеньеС = Дата(1,1,1,0,0,0);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ВремяРаботыВоскресеньеПО) Тогда
			Объект.ВремяРаботыВоскресеньеПО = Дата(1,1,1,0,0,0);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьНаКарте(Команда)

	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("ОткрытИзДокумента", Истина);
	ПараметрыФормы.Вставить("Партнер", Объект.Владелец);
	ПараметрыФормы.Вставить("Филиал", ТекущееПодразделение());
	ПараметрыФормы.Вставить("ВидДоставки", ПредопределенноеЗначение("Перечисление.ВидыДоставокДоКлиента.Розничная"));
	ПараметрыФормы.Вставить("Тариф", Тариф());
	ПараметрыФормы.Вставить("Адрес", Объект.АдресДоставкиКарта);		
	ПараметрыФормы.Вставить("НомерДома", Объект.НомерДома);
	ПараметрыФормы.Вставить("НомерКвартиры", Объект.НомерКвартиры);
	ПараметрыФормы.Вставить("ЭтоЧастныйДом", Объект.НомерКвартиры=0 И Объект.НомерОфиса=0);  
	ПараметрыФормы.Вставить("НомерКорпуса", Объект.НомерКорпуса);
	ПараметрыФормы.Вставить("НомерОфиса", Объект.НомерОфиса);
	ПараметрыФормы.Вставить("ДополнениеКАдресу", Объект.ДополнениеКАдресу);	
	ПараметрыФормы.Вставить("Широта", Объект.Широта);
	ПараметрыФормы.Вставить("Долгота", Объект.Долгота);
	ПараметрыФормы.Вставить("ТарифВРучную", Ложь);
	
	ПараметрыФормы.Вставить("ПараметрыРазгрузкиАдресВХранилище",ПолучитьПараметрыРазгрузки());
	
	ОписаниеОповещения= Новый ОписаниеОповещения("РассчитатьСтоимостьДоставкиЗавершение", ЭтаФорма);
	ОткрытьФорму("Обработка.КартографическийИнтерфейсДоставка.Форма.Карта", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВыходныеПриИзменении(Элемент)
	
	УстановитьОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыходныеОчистка(Элемент, СтандартнаяОбработка)
	
	УстановитьОформление();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьСтоимостьДоставкиЗавершение(ДанныеКарты, ДопПараметры) Экспорт 
	
	Если ДанныеКарты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность= Истина;
		
	Объект.Широта= ДанныеКарты.Широта;
	Объект.Долгота= ДанныеКарты.Долгота;
	Объект.ЗонаДоставкиДляВодителя = Обработки.КартографическийИнтерфейсДоставка.ПолучитьЗонуДоставкиПоНаименованию(ДанныеКарты.Зона);
		
	Объект.АдресДоставкиКарта = ДанныеКарты.Адрес;
	Объект.Адрес= Объект.АдресДоставкиКарта;
	
	ЗаполнитьЗначенияСвойств(Объект,ДанныеКарты,"НомерДома,НомерКвартиры,НомерКорпуса,НомерОфиса,ДополнениеКАдресу");

	//адрес детально
	Если Прав(Объект.Адрес, СтрДлина(Объект.НомерДома)) = Объект.НомерДома Тогда
		Объект.Адрес = Лев(Объект.Адрес, СтрДлина(Объект.Адрес) - СтрДлина(Объект.НомерДома))	+ "дом " + Объект.НомерДома
	Иначе
		Объект.Адрес = Объект.Адрес + ", дом " + Объект.НомерДома;
	КонецЕсли;
		
	Если Объект.НомерКорпуса<>0 Тогда
		Объект.Адрес = Объект.Адрес + ", корп. " + Объект.НомерКорпуса;
	КонецЕсли;
	
	Если Объект.НомерКвартиры<>0 Тогда
		Объект.Адрес = Объект.Адрес + ", кв. " + Объект.НомерКвартиры;
	КонецЕсли;
	
	Если Объект.НомерОфиса<>0 Тогда
		Объект.Адрес = Объект.Адрес + ", оф. " + Объект.НомерОфиса;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Объект.ДополнениеКАдресу) Тогда
		Объект.Адрес = Объект.Адрес + ", " + Объект.ДополнениеКАдресу;
	КонецЕсли;
	

КонецПроцедуры

Функция ТекущееПодразделение()
	
	Возврат Пользователи.ТекущийПользователь().Подразделение;
	
КонецФункции

Функция Тариф()
	
	Возврат Справочники.ТарифыПеревозчиков.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура УстановитьОформление()
	
	Если ЗначениеЗаполнено(Объект.Выходные) Тогда
		Элементы.ГруппаСуббота.Видимость = Не (Объект.Выходные = "суббота" ИЛИ Объект.Выходные = "суббота, воскресенье");
		Элементы.ГруппаВоскресенье.Видимость = Не (Объект.Выходные = "воскресенье" ИЛИ Объект.Выходные = "суббота, воскресенье");
	Иначе
		Элементы.ГруппаСуббота.Видимость = Истина;
		Элементы.ГруппаВоскресенье.Видимость = Истина;
	КонецЕсли;
	ВидимостьСписков();
	
КонецПроцедуры	

Функция ПолучитьПараметрыРазгрузки()
	
	ПараметрыРазгрузки = УправлениеЛогистикойСервер.ПолучитьСтруктуруПараметровРазгрузки();
		
	ПараметрыРазгрузкиАдресВХранилище = ПоместитьВоВременноеХранилище(ПараметрыРазгрузки,ЭтотОбъект.УникальныйИдентификатор);
		
	Возврат ПараметрыРазгрузкиАдресВХранилище;
	
КонецФункции

&НаКлиенте
Процедура СтендПриИзменении(Элемент)
	 ВидимостьСписков();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьСписков()

	Элементы.Стенды.Видимость=Объект.Стенд;
	Элементы.Субдилеры.Видимость=Объект.Субдилер;
	

КонецПроцедуры

&НаКлиенте
Процедура СубдиллерПриИзменении(Элемент)
	ВидимостьСписков();
КонецПроцедуры

#КонецОбласти
